[NoCoverage] BlockStatement
app/layout.tsx:14:5
   children,
 }: Readonly<{
   children: React.ReactNode;
-}>) {
-  return (
-    <html lang="en">
-      <body>
-        {children}
-      </body>
-    </html>
-  );
-}
+}>) {}
 
