[Killed] StringLiteral
app/page.tsx:8:54
   return (
     <div className={styles.page}>
       <main className={styles.main}>
-        <div style={{ textAlign: 'center', maxWidth: '600px' }}>
+        <div style={{ textAlign: 'center', maxWidth: "" }}>
           <h1 style={{ 
             fontSize: '3.5rem', 
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 1
+ Received  + 1

@@ -4,11 +4,11 @@

[Killed] StringLiteral
app/page.tsx:8:34
   return (
     <div className={styles.page}>
       <main className={styles.main}>
-        <div style={{ textAlign: 'center', maxWidth: '600px' }}>
+        <div style={{ textAlign: "", maxWidth: '600px' }}>
           <h1 style={{ 
             fontSize: '3.5rem', 
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 1
+ Received  + 1

@@ -4,11 +4,11 @@

[Killed] ObjectLiteral
app/page.tsx:9:22
     <div className={styles.page}>
       <main className={styles.main}>
         <div style={{ textAlign: 'center', maxWidth: '600px' }}>
-          <h1 style={{ 
-            fontSize: '3.5rem', 
-            fontWeight: 'bold', 
-            marginBottom: '1rem',
-            background: 'linear-gradient(135deg, #667eea 0%, #764ba2 100%)',
-            WebkitBackgroundClip: 'text',
-            WebkitTextFillColor: 'transparent',
-            backgroundClip: 'text'
-          }}>
+          <h1 style={{}}>
             🎁 Gyft Ninja
           </h1>
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 3
+ Received  + 1

@@ -6,13 +6,11 @@

[Killed] StringLiteral
app/page.tsx:13:25
             fontSize: '3.5rem', 
             fontWeight: 'bold', 
             marginBottom: '1rem',
-            background: 'linear-gradient(135deg, #667eea 0%, #764ba2 100%)',
+            background: "",
             WebkitBackgroundClip: 'text',
             WebkitTextFillColor: 'transparent',
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 1
+ Received  + 1

@@ -7,11 +7,11 @@

[Killed] StringLiteral
app/page.tsx:25:25
             fontSize: '1.5rem', 
             marginBottom: '2rem', 
             color: '#666',
-            lineHeight: '1.6'
+            lineHeight: ""
           }}>
             Discover <strong>unbelievable gift ideas</strong> with AI-powered intelligence that knows exactly what your loved ones want
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 1
+ Received  + 1

@@ -12,11 +12,11 @@

[Killed] StringLiteral
app/page.tsx:30:39
             Discover <strong>unbelievable gift ideas</strong> with AI-powered intelligence that knows exactly what your loved ones want
           </p>
 
-          <div style={{ marginBottom: '3rem' }}>
+          <div style={{ marginBottom: "" }}>
             <p style={{ 
               fontSize: '1.1rem', 
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 3
+ Received  + 1

@@ -20,13 +20,11 @@

[Killed] ObjectLiteral
app/page.tsx:30:23
             Discover <strong>unbelievable gift ideas</strong> with AI-powered intelligence that knows exactly what your loved ones want
           </p>
 
-          <div style={{ marginBottom: '3rem' }}>
+          <div style={{}}>
             <p style={{ 
               fontSize: '1.1rem', 
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 3
+ Received  + 1

@@ -20,13 +20,11 @@

[Killed] ObjectLiteral
app/page.tsx:46:22
           <div className={styles.ctas}>
             <button 
               className={styles.primary}
-              style={{
-                background: 'linear-gradient(135deg, #667eea 0%, #764ba2 100%)',
-                border: 'none',
-                fontSize: '1.1rem',
-                fontWeight: '600',
-                padding: '0 32px',
-                height: '56px'
-              }}
+              style={{}}
             >
               🎯 Find the Perfect Gift
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 1
+ Received  + 0

@@ -34,11 +34,10 @@

[Survived] StringLiteral
app/page.tsx:48:25
               className={styles.primary}
               style={{
                 background: 'linear-gradient(135deg, #667eea 0%, #764ba2 100%)',
-                border: 'none',
+                border: "",
                 fontSize: '1.1rem',
                 fontWeight: '600',

[Killed] StringLiteral
app/page.tsx:51:26
                 border: 'none',
                 fontSize: '1.1rem',
                 fontWeight: '600',
-                padding: '0 32px',
+                padding: "",
                 height: '56px'
               }}
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 1
+ Received  + 1

@@ -34,11 +34,11 @@

[Killed] ObjectLiteral
app/page.tsx:60:21
           </div>
         </div>
 
-        <div style={{ 
-          display: 'grid', 
-          gridTemplateColumns: 'repeat(auto-fit, minmax(250px, 1fr))', 
-          gap: '2rem', 
-          marginTop: '4rem',
-          maxWidth: '800px'
-        }}>
+        <div style={{}}>
           <div style={{ 
             textAlign: 'center', 
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 3
+ Received  + 1

@@ -40,13 +40,11 @@

[Killed] StringLiteral
app/page.tsx:61:20
         </div>
 
         <div style={{ 
-          display: 'grid', 
+          display: "", 
           gridTemplateColumns: 'repeat(auto-fit, minmax(250px, 1fr))', 
           gap: '2rem', 
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 1
+ Received  + 1

@@ -41,11 +41,11 @@

[Killed] StringLiteral
app/page.tsx:63:16
         <div style={{ 
           display: 'grid', 
           gridTemplateColumns: 'repeat(auto-fit, minmax(250px, 1fr))', 
-          gap: '2rem', 
+          gap: "", 
           marginTop: '4rem',
           maxWidth: '800px'
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 1
+ Received  + 1

@@ -41,11 +41,11 @@

[Killed] StringLiteral
app/page.tsx:69:22
         }}>
           <div style={{ 
             textAlign: 'center', 
-            padding: '2rem', 
+            padding: "", 
             borderRadius: '12px', 
             background: 'var(--gray-alpha-100)',
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 1
+ Received  + 1

@@ -44,11 +44,11 @@

[Killed] StringLiteral
app/page.tsx:71:25
             textAlign: 'center', 
             padding: '2rem', 
             borderRadius: '12px', 
-            background: 'var(--gray-alpha-100)',
+            background: "",
             border: '1px solid var(--gray-alpha-200)'
           }}>
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 1
+ Received  + 1

@@ -44,11 +44,11 @@

[Killed] ObjectLiteral
app/page.tsx:75:24
             border: '1px solid var(--gray-alpha-200)'
           }}>
             <div style={{ fontSize: '2.5rem', marginBottom: '1rem' }}>🧠</div>
-            <h3 style={{ marginBottom: '0.5rem', fontSize: '1.2rem' }}>AI-Powered Intelligence</h3>
+            <h3 style={{}}>AI-Powered Intelligence</h3>
             <p style={{ color: '#666', fontSize: '0.9rem' }}>
               Advanced algorithms analyze personality traits and preferences
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 3
+ Received  + 1

@@ -51,13 +51,11 @@

[Killed] ObjectLiteral
app/page.tsx:81:23
             </p>
           </div>
 
-          <div style={{ 
-            textAlign: 'center', 
-            padding: '2rem', 
-            borderRadius: '12px', 
-            background: 'var(--gray-alpha-100)',
-            border: '1px solid var(--gray-alpha-200)'
-          }}>
+          <div style={{}}>
             <div style={{ fontSize: '2.5rem', marginBottom: '1rem' }}>💝</div>
             <h3 style={{ marginBottom: '0.5rem', fontSize: '1.2rem' }}>Personalized Suggestions</h3>
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 3
+ Received  + 1

@@ -62,13 +62,11 @@

[Killed] ObjectLiteral
app/page.tsx:88:25
             background: 'var(--gray-alpha-100)',
             border: '1px solid var(--gray-alpha-200)'
           }}>
-            <div style={{ fontSize: '2.5rem', marginBottom: '1rem' }}>💝</div>
+            <div style={{}}>💝</div>
             <h3 style={{ marginBottom: '0.5rem', fontSize: '1.2rem' }}>Personalized Suggestions</h3>
             <p style={{ color: '#666', fontSize: '0.9rem' }}>
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 3
+ Received  + 1

@@ -65,13 +65,11 @@

[Killed] StringLiteral
app/page.tsx:90:32
           }}>
             <div style={{ fontSize: '2.5rem', marginBottom: '1rem' }}>💝</div>
             <h3 style={{ marginBottom: '0.5rem', fontSize: '1.2rem' }}>Personalized Suggestions</h3>
-            <p style={{ color: '#666', fontSize: '0.9rem' }}>
+            <p style={{ color: "", fontSize: '0.9rem' }}>
               Tailored recommendations based on relationships and occasions
             </p>
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 1
+ Received  + 1

@@ -76,11 +76,11 @@

[Killed] StringLiteral
app/page.tsx:90:50
           }}>
             <div style={{ fontSize: '2.5rem', marginBottom: '1rem' }}>💝</div>
             <h3 style={{ marginBottom: '0.5rem', fontSize: '1.2rem' }}>Personalized Suggestions</h3>
-            <p style={{ color: '#666', fontSize: '0.9rem' }}>
+            <p style={{ color: '#666', fontSize: "" }}>
               Tailored recommendations based on relationships and occasions
             </p>
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 1
+ Received  + 1

@@ -76,11 +76,11 @@

[Killed] StringLiteral
app/page.tsx:96:24
           </div>
 
           <div style={{ 
-            textAlign: 'center', 
+            textAlign: "", 
             padding: '2rem', 
             borderRadius: '12px', 
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 1
+ Received  + 1

@@ -82,11 +82,11 @@

[Killed] StringLiteral
app/page.tsx:98:27
           <div style={{ 
             textAlign: 'center', 
             padding: '2rem', 
-            borderRadius: '12px', 
+            borderRadius: "", 
             background: 'var(--gray-alpha-100)',
             border: '1px solid var(--gray-alpha-200)'
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 1
+ Received  + 1

@@ -82,11 +82,11 @@

[Killed] ObjectLiteral
app/page.tsx:102:25
             background: 'var(--gray-alpha-100)',
             border: '1px solid var(--gray-alpha-200)'
           }}>
-            <div style={{ fontSize: '2.5rem', marginBottom: '1rem' }}>✨</div>
+            <div style={{}}>✨</div>
             <h3 style={{ marginBottom: '0.5rem', fontSize: '1.2rem' }}>Unforgettable Moments</h3>
             <p style={{ color: '#666', fontSize: '0.9rem' }}>
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 3
+ Received  + 1

@@ -84,13 +84,11 @@

[Killed] ObjectLiteral
app/page.tsx:103:24
             border: '1px solid var(--gray-alpha-200)'
           }}>
             <div style={{ fontSize: '2.5rem', marginBottom: '1rem' }}>✨</div>
-            <h3 style={{ marginBottom: '0.5rem', fontSize: '1.2rem' }}>Unforgettable Moments</h3>
+            <h3 style={{}}>Unforgettable Moments</h3>
             <p style={{ color: '#666', fontSize: '0.9rem' }}>
               Create lasting memories with gifts that truly matter
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 3
+ Received  + 1

@@ -89,13 +89,11 @@

[Killed] StringLiteral
app/page.tsx:112:28
       </main>
 
       <footer className={styles.footer}>
-        <p style={{ color: '#888', fontSize: '0.9rem', textAlign: 'center' }}>
+        <p style={{ color: "", fontSize: '0.9rem', textAlign: 'center' }}>
           © 2024 Gyft Ninja - Making gift-giving an art form
         </p>
killedBy: Landing Page renders the complete landing page structure
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Landing Page renders the complete landing page structure 1`

- Snapshot  - 1
+ Received  + 1

@@ -106,11 +106,11 @@
