[NoCoverage] BlockStatement
app/layout.tsx:59:31
  */
 export default function RootLayout({
   children,
-}: Readonly<RootLayoutProps>) {
-  return (
-    <html lang="en">
-      <body>
-        {children}
-      </body>
-    </html>
-  );
-}
+}: Readonly<RootLayoutProps>) {}
 
